avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
/**
 * @file main.c
 *
 * @brief MAC Example Beacon Application - Device
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 */

/**
 * \mainpage
 * \section preface Preface
 * This is the reference manual for the IEEE 802.15.4 MAC Beacon Application -
 * Device
 * \section main_files Application Files
 *      - main.c                 Application main file.
 * \section intro Application Introduction
 * The basic MAC Example Beacon Application deploys a beacon-enabled network
 * with star topology.
 * The coordinator starts a PAN at channel DEFAULT_CHANNEL with the PAN ID
 * DEFAULT_PAN_ID.
 *
 * The coordinator starts a beaconing network and transmits user data within
 * beacon payload of transmitted beacon frames.
 * The device scans for this network,sync up with the coordinator and associates
 * to the coordinator.The devices receive
 * these beacon frames, extract the receveived user data from the coordinator
 *,print the received data on the hyper
 * terminal and also sends the extracted beacon payload back to the coordinator.
 * The coordinator also transmits broadcast data frames periodically.The devices
 * receive these broadcast data frames
 * and increase a counter.
 * The coordinator also puts the data in the indirect queue periodically and
 * transmits data frames based on the
 * periodic poll request from the device.
 * The results of the proper data transmission/reception are printed to a
 * terminal program via Serial I/O (UART or USB).
 * For demonstration purposes the coordinator's configuration is limited to
 * associate maximum of 100 devices.
 * \note For Two Processor Approach the Application needs to be flashed in the
 * Host board(eg.SAM4L-Xplained Pro) and the Serial-if application (Beacon
 * FFD)(MAC Stack)
 * needs to be flashed in the NCP(Network CoProcessor) board.
 * \section api_modules Application Dependent Modules
 * - \subpage api
 * \section compinfo Compilation Info
 * This software was written for the GNU GCC and IAR .
 * Other compilers may or may not work.
 *
 * \section references References
 * 1)  IEEE Std 802.15.4-2006 Part 15.4: Wireless Medium Access Control (MAC)
 *     and Physical Layer (PHY) Specifications for Low-Rate Wireless Personal
 * Area
 *     Networks (WPANs).\n\n
 * 2)  <a href="https://www.microchip.com/support/">Atmel Design
 * Support</a>.\n
 *
 * \section contactinfo Contact Information
 * For further information,visit
 * <A href="http://www.microchip.com/design-centers/8-bit">www.atmel.com</A>.\n
 */

#include <string.h>
#include <inttypes.h>
#include <stdio.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sio2host.h"
#include "common_hw_timer.h"
#include "beacon_app.h"
#include <asf.h>

/* === MACROS ============================================================== */
/** Channel Offset will give us the channel number as (CHANNEL_OFFSET + 11) */
#define CHANNEL_OFFSET                  (0)

/** Defines the short scan duration time. */
#define SCAN_DURATION_SHORT             (5)
/** Defines the long scan duration time. */
#define SCAN_DURATION_LONG              (6)

/*
 * This is the timeout in ms once the node tries to synchronize with the
 * coordinator. This timeout is set so that the node should be able to receive
 * at least a beacon frame from its parent.
 * In case the Beacon Order is increased to a high value, this timeout might
 * need to be increased as well.
 */
#define TIMER_SYNC_BEFORE_ASSOC_MS      (3000)
#define APP_GUARD_TIME_US               (10000)
#define MCU_WAKEUP_TIME                 (150)
#define PAYLOAD_LEN                     (104)

#ifdef GTS_SUPPORT
#define GTS_PAYLOAD_LEN                 (18)
#endif
#if (LED_COUNT >= 3)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED1)
#define LED_DATA                        (LED2)
#elif (LED_COUNT == 2)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED1)
#else
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED0)
#define LED_DATA                        (LED0)
#endif

/* === GLOBALS ============================================================= */
extern uint8_t default_key_source[8];
/* This structure stores the short and extended address of the coordinator. */
wpan_addr_spec_t coord_addr_spec;

/* This variable counts the number of received broadcast data frames. */
static uint32_t bc_rx_cnt;

/* This variable counts the number of received indirect data frames. */
static uint32_t indirect_rx_cnt;
/** This variable stores the current state of the node. */
app_state_t app_state = APP_IDLE;
static uint8_t APP_TIMER;
#ifdef RTC_SLEEP
struct rtc_module rtc_instance;
#endif
/* RTC Configuration and Callback functions */

/** This function shows the stack and application
 *  capabilities on terminal if SIO_HUB switch
 *  is enabled.
 */
static void print_stack_app_build_features(void);

#ifdef RTC_SLEEP

/**
 * @brief Configuring RTC Callback Funtion on Overflow
 *
 * @param void
 */
void configure_rtc_callbacks(void);

/**
 * @brief Configures and enables RTC count value
 *
 * @param void
 */
void configure_rtc_count(void);

/**
 * @brief Callback Function indicating RTC Overflow
 *
 * @param void
 */
void rtc_overflow_callback(void);

#endif

/** This array stores the current msdu payload. */
static uint8_t msdu_payload[PAYLOAD_LEN];

uint8_t current_channel;
uint8_t current_channel_page;
static uint32_t channels_supported;

#if (defined ENABLE_SLEEP || defined RTC_SLEEP)

/**
 * @brief API called to put the controller Power save mode with 4MHz timer
 *
 * @param timeout Time duration in microseconds for which controller can sleep
 */
static void  enter_sleep(uint32_t timeout);

/**
 * @brief Callback function to wakeup and switching to the default clock source
 * for starting MAC timers
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
void wakeup_cb(void *parameter);

