avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter)
{
	LED_Off(LED_DATA);

	parameter = parameter; /* Keep compiler happy. */
}

#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
static void enter_sleep(uint32_t timeout)
{
	/*Entering Power save after configuring Timer running at 4MHz as Wakeup
	 * source*/
	sys_sleep = true;
	#ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();

	/* Stop the Software timer running at CPU clock and initialize the
	 * software timer to run at 4MHz clock*/
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	timeout = timeout - MCU_WAKEUP_TIME;
	/*Start Wakeup timer*/
	sw_timer_start(APP_TIMER_SLEEP, timeout,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)wakeup_cb,
			NULL);
	LEAVE_CRITICAL_REGION();
	/* put the MCU in idle mode with timer as wakeup source*/
	system_set_sleepmode(SYSTEM_SLEEPMODE_IDLE_2);
	system_sleep();
    #endif
    #ifdef RTC_SLEEP
	/*Configure the rtc module and callback*/
	configure_rtc_count();
	/* Configure and enable callback */
	configure_rtc_callbacks();
	/* Set timeout period for rtc*/
	res = timeout % 1000;
	timeout = timeout / 1000;
	rtc_count_set_period(&rtc_instance, timeout);
	rtc_count_enable(&rtc_instance);
	system_set_sleepmode(SYSTEM_SLEEPMODE_STANDBY);
	system_sleep();
	#endif
}

#ifdef RTC_SLEEP
void configure_rtc_count(void) /* Configuring rtc clock prescaler and mode*/
{
	struct rtc_count_config config_rtc_count;
	rtc_count_get_config_defaults(&config_rtc_count);
	config_rtc_count.prescaler           = RTC_COUNT_PRESCALER_DIV_1;
	config_rtc_count.mode                = RTC_COUNT_MODE_16BIT;

	/* Continuously update the counter value so no synchronization is
	 * needed for reading. */
	config_rtc_count.continuously_update = true;
	rtc_count_init(&rtc_instance, RTC, &config_rtc_count);
}

void configure_rtc_callbacks(void)
{
	/*Register rtc callback*/
	rtc_count_register_callback(&rtc_instance, rtc_overflow_callback,
			RTC_COUNT_CALLBACK_OVERFLOW);
	rtc_count_enable_callback(&rtc_instance, RTC_COUNT_CALLBACK_OVERFLOW);
}

void rtc_overflow_callback(void)
{
	/* Do something on RTC overflow here */
	rtc_count_disable(&rtc_instance);
	/* Wakeup callback to switch the timer to default cpu clock*/
	wakeup_cb(NULL);
}

#endif
void wakeup_cb(void *parameter)
{
	sys_sleep = false;
    #ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();

	/* Stop the Software timer running at 4MHz clock and initialize the
	 * software timer to default cpu clock*/
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	sw_timer_stop(APP_TIMER_SLEEP);
	LEAVE_CRITICAL_REGION();
	#endif

	/* Callback Function in MAC for beacon Synchronization and Handling the
	 * residual time after Wakeup*/
	mac_wakeup(res);
}

#endif

/*
 * @brief This function will show up the application
 *        and stack build features and available in the firmware
 * @param void
 *
 */
static void print_stack_app_build_features(void)
{
#ifdef STB_ON_SAL
	printf("\r\n Security Tool Box On SAL : Enabled");
#else
	printf("\r\n Security Tool Box On SAL : Disabled");
#endif

#ifdef MAC_SECURITY_ZIP
	printf("\r\n MAC Data & Security Module : Enabled");
#else
	printf("\r\n MAC Data & Security Module : Disabled");
#endif

#ifdef MAC_SECURITY_BEACON
	printf("\r\n MAC Beacon Security : Enabled");
#else
	printf("\r\n MAC Beacon Security : Disabled");
#endif

#ifdef HIGH_DATA_RATE_SUPPORT
	printf("\r\n High Data Rate Support : Enabled");
#else
	printf("\r\n High Data Rate Support : Disabled");
#endif

#ifdef GTS_SUPPORT
	printf("\r\n MAC GTS Support : Enabled\r\n\r\n");
#else
	printf("\r\n MAC GTS Support : Disabled\r\n\r\n");
#endif
}
